{
  "articles": [
    {
      "title": "AI Coding-第一课",
      "slug": "ai-coding-第一课",
      "content": "AI Coding-第一课\n\n作业一：痛点挖掘机\n\n第一步：观察与记录\n\n回顾我（用户）过去一个月进行AI漫剧创作的经历，记录下3个最真实、具体的低效场景：\n\nPlain Text场景1：周一晚上，在家中寻找剧本灵感做什么：打算制作一个“穿越逆袭”题材的1分钟漫剧。我在各大剧本交易网站、小说平台搜索，试图购买或找到一个合适的短剧本。为什么烦：专业的短视频剧本价格昂贵（数百至上千元），远超个人创作者的预算；而免费的小说片段或故事梗概又过于冗长，缺乏分镜、动作指示和台词节奏等直接用于AI生成的要素，需要花费大量时间自己改编，效果还不好。场景2：周三下午，试图用通用AI工具“拼凑”剧本做什么：我转而求助豆包、DeepSeek、通义千问，输入“帮我写一个穿越成豪门弃妇后逆袭的1分钟短视频剧本”。为什么烦：AI生成的文本更像是小说概述或对话清单，没有标准的场景（INT./EXT.）、角色动作描述和镜头语言。我需要反复用“请加入镜头描述”、“把对话写得更口语化”、“冲突再强烈一点”等指令去“训练”AI，过程琐碎，生成的结果仍不专业，像业余编剧写的。场景3：周五全天，纠结是否与平台签约做什么：了解到某些平台提供免费的剧本库和AI工具，但前提是需要签署独家合作协议，将作品发布在该平台。为什么烦：我既想获得专业的剧本支持，又不愿意失去在多平台发布、运营个人品牌和商业变现的自主权。这种“绑定”让我感到受限和不安，仿佛创作不再完全属于自己。\n\n第二步：选最值得解决的\n\n我选择场景2（使用通用AI生成剧本效率低下、质量不专业）作为最高优先级的痛点。评估如下：\n\nPlain Text频率：每次创作新作品时必然发生，是绕不开的核心环节。持续时间：从开始使用AI辅助创作起就一直存在，长期困扰。单次耗时：为获得一个勉强可用的剧本草稿，平均需要与AI进行10-15轮对话，耗时60-90分钟。改变价值：极高。若能一键生成专业格式、可直接投入生产的AI漫剧剧本，将直接把核心创作环节的效率提升数倍，并显著提升成片质量，解决从“想法”到“可执行脚本”的最大障碍。\n\n第三步：深层分析\n\n第一层：现在怎么做（What）\n\n我现在的做法：\n\nPlain Text打开一个通用AI对话界面（1分钟）。构思并输入一个包含题材、核心情节的复杂提示词，例如：“写一个关于职场新人反击霸凌上司的短剧，要有一波三折，最后爽快反转。”（3分钟）。等待AI生成一段叙事性文字（1分钟）。阅读后发现是故事大纲，于是发出指令：“请把上面的大纲改写成正式剧本，要有场景、动作和对话。”（2分钟）。AI生成的“剧本”格式混乱，动作和对话不分，于是我继续细化：“用‘场景：’开头，动作用括号括起来，对话单独成行。”（2分钟）。重复步骤3-5，不断纠正格式、人设、台词，直到筋疲力尽（循环50-70分钟）。将最终文本复制到文档，手动做最后调整（10分钟）。总耗时：70-90分钟。绝大部分时间和精力都消耗在“格式纠正”和“概念对齐”上，而非故事创作本身。\n\n第二层：最想摔键盘的地方（Why烦）\n\nPlain Text最让我烦躁的是在进行第6步，与AI进行无限循环的“猜谜修正”时。我明明想要一个“专业剧本”，但AI始终像一个不懂行的外行，给出的东西总是差一点。我感觉自己不是在创作，而是在对一个不理解基本行业规则的学生进行枯燥的格式辅导。这种沟通充满了误解和返工，让我对工具的期待一次次落空，创作的激情被琐碎的纠正过程消耗殆尽。\n\n第三层：根本原因是什么（Root Cause）\n\nPlain Text根本问题分析：问：为什么通用AI写不出我想要的漫剧剧本？答：因为它不理解“AI漫剧剧本”是一个高度专业化的交付物，有其特定的格式、节奏和元素要求。问：如果我学习更复杂的提示词工程，能把AI“调教”成专业编剧吗？答：极其困难，且不经济。问题不在于提示词技巧，而在于通用AI的底层训练数据中缺乏对“短视频分镜剧本”这一细分体裁的海量高质量学习。它不具备这个领域的“肌肉记忆”。问：那真实问题是什么？答：是专业化知识的缺失。创作者拥有领域意图（想做爆款漫剧），通用AI拥有语言能力，但两者之间缺少一个能将前者翻译成后者可精准执行的专业化“编译器”或“结构化框架”。根本原因：不是“创作者不会提问”或“AI不够强”而是“缺少一个内置了漫剧创作领域知识（格式、节奏、爆款元素）的专用型内容生成引擎”。\n\n第四步：用户识别\n\n核心用户\n\nPlain Text核心用户：独立的AI漫剧创作者/小型工作室。他们精通AI绘图、动画生成、视频剪辑等技术工具，具备良好的网感和审美，但严重缺乏剧本创作能力和编剧专业知识。追求创作自由，对平台绑定敏感，预算有限但愿意为真正提升效率的专业工具付费。边缘用户：新媒体运营：需要快速生产短剧内容用于品牌宣传。编剧爱好者/新手：想进入短剧领域但缺乏经验和格式训练。MCN机构：需要批量、稳定地生成剧本初稿供旗下达人选择。\n\n第五步：提炼用户真实需求\n\nPlain Text表面需求：“我需要一个能一键生成剧本的工具。”真实需求：“我需要一个能理解并产出符合AI漫剧工业化生产标准剧本的工具，让我能像调用技术API一样，通过简单设置就获得专业、可用的剧本初稿，从而将精力聚焦于视觉化和后期制作。”更深层的需求：渴望获得专业的创作赋能，而非简单的文本生成；希望保持创作的自主权和灵活性；需要降低内容产出的不确定性和试错成本。\n\n第六步：写成一段话\n\n我的用户是缺乏编剧专业知识的独立AI漫剧创作者。他们目前最大的痛苦在于，无法高效获得格式专业、节奏合适、可直接用于AI生成的剧本。购买剧本成本过高，使用通用AI工具则陷入无尽的“格式纠正”和“意图对齐”循环，耗时耗力且结果不理想。他们真正需要的，是一个内置了漫剧领域知识、能通过结构化参数设置（如题材、时长、风格）一键生成专业剧本初稿的“领域专用AI”，从而跨越从创意到可执行脚本的鸿沟，重获创作流程的主导权。\n\n\n\n\n\n\n\n作业二：MVP架构师\n\n第一步：设计核心链路\n\nMVP只聚焦验证一个核心假设：\n\n一个能通过结构化参数（如题材、时长、风格）一键生成专业格式剧本的工具，能显著降低AI漫剧创作者的创作门槛和时间成本，解决从“模糊创意”到“可执行脚本”的核心断点。\n\n思考过程：\n\nPlain Text用户真实需求：在拥有一个模糊创意（如“逆袭”）时，能无需编剧知识，就快速获得一个符合行业制作标准、可直接用于后续AI生成的剧本。要验证这个需求，最少需要什么？答：一个极简的输入界面，让用户能通过最直观的方式（如关键词、下拉菜单）定义创作意图；以及一个专业化的输出引擎，能将这些意图转化为格式严谨的剧本。这个核心链路成功的标志：当创作者萌生一个新故事点子时，他的第一反应是打开这个工具，完成“输入点子-选择参数-生成”的流程，并且生成的剧本无需复杂修改即可投入视觉化制作。不需要做什么：不需要复杂的剧本编辑器和多版本对比（生成后支持简单文本编辑即可）。不需要AI根据反馈进行多轮自动优化（手动修改就是验证）。不需要项目管理、团队协作、高级素材库等所有外围功能。\n\n核心链路：\n\nPlain Text✅ 好核心链路（MVP范围）：“结构化创作”循环：用户打开应用 → 输入一句话创意或选择题材标签 → 设置核心参数（时长、基调） → 一键生成 → 获得一个格式专业、可直接微调使用的标准剧本。（仅验证这个“结构化输入-专业化输出”的循环是否成立、是否有效。）❌ 坏的核心链路（偏离验证目标）：“输入需求 → AI生成多个故事大纲 → 用户选择其一 → AI展开为分镜 → 用户调整分镜 → 生成最终剧本”（流程过长，无法快速验证核心价值）。“生成剧本 → 自动匹配角色形象 → 生成分镜预览图 → 输出视频粗剪”（功能堆砌，脱离了“验证剧本生成可行性”的根本目的）。\n\n第二步：选择乐高组件\n\nPlain Text能力1：实现可交互的原型界面  选项：Enter/秒哒/trea前端组件库  问：我选谁？为什么？  答：选秒哒。秒哒适合我这种新手操作。能力2：存储用户会话与画布数据  选项：Supabase / 阿里云RDS  问：我选谁？为什么？  答：选Supabase。它一站式提供数据库、身份认证（Auth）和实时同步功能，用最小技术成本解决数据存储与用户管理的核心问题。能力3：连接与调用多个大语言模型  选项：后端中转API / 浏览器直连  问：我选谁？为什么？  答：选“后端中转API”。为保障API密钥安全、统一各模型响应格式并实现稳定的流式输出，必须通过自建后端服务进行代理调用。能力4：部署与分发产品  选项：Vercel / Netlify  问：我选谁？为什么？  答：选Vercel。它与现代前端工作流集成度最高，能实现代码提交后的自动部署，是让产品上线最快、最可靠的途径。能力5：观测用户核心行为  选项：PostHog / MixPanel  问：我选谁？为什么？  答：选PostHog。它开箱即用、注重隐私合规，且提供开源版本。MVP阶段仅需埋点监测“创建画布”、“并行提问”等关键事件，验证核心功能的使用情况。能力6：管理代码版本与协作  选项：GitHub / GitLab  问：我选谁？为什么？  答：选GitHub。行业标准，与Vercel等工具集成无缝，方便进行代码版本管理和团队协作开发。能力7：获取搜索引擎自然流量（SEO）  选项：Google Search Console / 百度站长平台  问：我选谁？为什么？  答：两者都需要，但优先级取决于主要用户市场。若用户以国内为主，则优先提交并适配百度站长平台；若以海外为主，则优先使用 Google Search Console。理由：当产品价值被验证后，需要通过SEO从搜索引擎获取持续、免费的精准流量。提交网站地图（Sitemap）并优化页面内容是基础且关键的第一步。能力8：集成支付渠道，实现商业闭环  选项：国内（支付宝/微信支付）；海外（Stripe/PayPal）  问：我选谁？为什么？  答：根据目标市场选择。  针对国内市场：必须同时集成支付宝与微信支付。理由：两者共同覆盖了中国几乎全部的在线支付场景，是商业化的基础设施。  针对海外市场：优先集成Stripe。理由：Stripe的API设计卓越、文档完善，为开发者提供了从订阅到一次性支付最完整、集成最便捷的解决方案，是全球SaaS产品的首选。\n\n第三步：预见用户不买账的原因\n\n1. 心理层面——用户为什么“不想”用\n\nPlain Text不信任：认为AI生成的剧本缺乏“灵魂”，套路化严重，不如人写的有创意。控制感丧失恐惧：担心过度依赖工具会导致自身创意能力退化。\n\n2. 行为习惯层面——用户为什么“用不惯”\n\nPlain Text旧路径依赖：习惯了自己用通用AI“磨”剧本，或去某些平台找免费资源，改变习惯需要动力。学习成本：即便界面简单，理解“冲突强度”、“节奏曲线”等参数也需要一点点学习。\n\n3. 环境因素层面——用户为什么“没法”用\n\nPlain Text网络与访问：必须是稳定的Web应用或流畅的App，加载慢或常崩溃会直接劝退。\n\n4. 工程层面——产品为什么“做不出”或“稳不了”\n\nPlain Text数据壁垒：高质量、清洗过的专业剧本数据难以大量获取，是模型效果的核心瓶颈。生成效果波动：难以保证每一次生成的剧本都保持稳定在80分以上的可用水平，偶尔的“低智”输出会严重影响口碑。算力成本：高质量的实时生成对算力要求高，如何平衡体验与成本是挑战。\n\n总结：具体的避坑指南\n\nPlain TextMVP必须聚焦“生成质量”：前100个种子用户的口碑取决于第一次生成是否让他们“惊艳”。必须死磕剧本的专业性和可用性。设计上赋予用户“控制感”：提供便捷的修改和微调入口，强调产品是“助手”而非“替代者”。采用柔性推广策略：初期可提供极致的免费额度，让用户无风险体验，打破“不信任”和“习惯”壁垒。\n\n第四步：画出产品构思\n\n1、用户旅程图\n\nPlain Text阶段1：察觉痛苦：在通用AI中反复修改剧本受挫，或在平台看到高价剧本。阶段2：寻找方案：在社交媒体或创作者社群看到“AI漫剧工坊”推荐。阶段3：初次体验：访问网站，被简洁的生成界面吸引，尝试输入一个想法。阶段4：核心体验：惊讶于生成速度和质量，进行简单微调后导出。阶段5：分享与复用：将作品和生成过程分享到社群，并收藏该次生成的参数组合以备后用。\n\n\n\n2、数据流图\n\nPlain Text用户输入层：一句话创意、题材标签、时长、风格参数。意图解析与增强层：系统将简略输入，结合知识库（爆款元素）扩展为详细的、结构化的创作指令。专用模型生成层：微调后的LLM接收结构化指令，调用剧情模型，生成符合格式的专业剧本。输出与反馈层：将剧本呈现给用户，记录用户的微调操作（如修改某句台词），作为反馈数据用于模型持续优化。\n\n\n\n3、产品构思\n\nPlain Text主界面：一个极简的中央输入框，辅以醒目的题材按钮和几个核心参数滑块。剧本结果页：左侧为可实时编辑的剧本正文（格式高亮），右侧为可一键调整的整体参数面板和角色卡片。个人工作台：展示“我的剧本”、“灵感仓库”、“常用参数组合”历史。\n\n4、系统架构图\n\nPlain Text前端：静态Web应用，部署在CDN上。后端API网关：处理用户请求，进行鉴权和路由。核心服务：剧本生成服务（调用微调模型）、用户数据服务（管理剧本和历史）。数据与模型：微调模型集群、剧本与元素向量数据库、用户操作日志数据库。\n\n5、最后检查\n\nPlain Text是否解决了核心痛点？：是，通过专用模型和结构化输入，直接产出了专业格式剧本。MVP是否足够简单？：是，核心链路只有“输入-设置-生成-导出”四步。是否具备扩展性？：是，题材库、参数、模型均可后续迭代丰富。是否给用户留了控制空间？：是，提供了实时编辑和参数微调。\n\n\n\n\n\n作业总结与反思\n\n通过本次作业，我深刻体会到，定义问题远比寻找解决方案更重要。起初，我可能会将需求简单归结为“需要一个文本生成器”。但经过逐步拆解，我发现真问题在于“专业化翻译能力的缺失”。这提醒我，在做任何产品设计前，必须深入到用户的工作流和心智模型中去，分辨什么是“表面诉求”，什么是“本质需求”。真正的产品价值，在于构建那座连接通用能力与垂直领域专业需求的桥梁。\n\n\n\n\n\n对产品未来完整功能的构思\n\n“剧本-视觉”一体化生产管线：生成剧本后，可一键为每个场景生成匹配的AI绘画提示词，甚至直接调用Stable Diffusion等模型生成概念图或分镜草图，实现创作流程无缝衔接。\n\n角色资产管理与复用：创建的角色可生成并保存其视觉形象（如LoRA模型）、声音特征和性格标签，形成一个属于创作者自己的“角色宇宙”，在新剧本中直接调用。\n\n基于数据飞轮的“趋势洞察”与“个性化引擎”：随着使用数据积累，系统能分析出近期何种题材、何种反转更受市场欢迎，主动推荐给创作者。同时，模型能学习每位创作者的修改偏好，越用越懂你，生成更符合个人风格的内容。\n\n去中心化的创意集市：建立一个开放平台，允许资深创作者上传和出售自己训练的专属题材模型或精品角色模板。这既丰富了生态，也为核心用户（独立创作者）提供了新的变现路径，从根本上避免了被单一平台绑定，形成一个充满活力的创作者经济生态。",
      "publishedAt": "2026-02-04T11:27:57.257Z",
      "id": "1770204477259",
      "viewCount": 24,
      "createdAt": "2026-02-04T11:27:57.259Z",
      "updatedAt": "2026-02-04T11:27:57.259Z"
    },
    {
      "title": "AI Coding-第二课-产品设计PRD",
      "slug": "ai-coding-第二课-产品设计prd",
      "content": "AI Coding-第二课-产品设计PRD\n\nPRD | AI漫剧专业剧本生成平台\n\n\n\n背景\n\n独立的AI漫剧创作者正处于一个“能力剪刀差”的困境中：他们精通Stable Diffusion、Runway等视觉生成工具，却受困于专业剧本创作的超高门槛。第一课“痛点挖掘机”的揭示了一个残酷的现实：一位创作者为获得一份仅1分钟、勉强可用的剧本草稿，需要与通用AI进行多达15轮对话，耗时超过90分钟。其根本原因并非AI不智能，而是通用AI（如豆包、DeepSeek）的训练语料与“工业级短视频分镜剧本”的专业格式、节奏和叙事范式存在结构性错位。创作者被迫从零开始“教”AI行业常识，这种高强度的“格式纠偏”工作，彻底扼杀了创作的核心乐趣与效率。市场迫切需要一款 “内置了编剧思维” 的专用工具，将创作者从繁琐的“提示词工程”中解放出来，直接输出可投入生产的专业剧本。\n\n\n\n目标\n\n核心功能目标：上线一个具备“短视频剧本思维”的生成引擎，支持用户通过结构化表单（题材+人设+核心冲突）或简短自然语言描述，在单次操作内，生成符合“场景-动作-对白”标准格式、时长精确控制在45-90秒的专业剧本。\n\n效率与质量目标：将“从创意到可编辑剧本初稿”的核心流程耗时，从 90分钟降低至2分钟以内，并将剧本的格式专业度（通过内置模板保证）提升至可直接用于分镜设计的水平。\n\n商业与体验目标：作为独立SaaS工具运营，绝不绑定任何内容发布平台，保障创作者的创作自由与多平台分发权；通过极简的交互设计，让创作者感觉像是在与一位“专业编剧助理”协作，而非调试一台机器。\n\n\n\n范围\n\n面向创作者的核心工作台（Web端）：\n\n智能创作中心：包含“极简模式”（输入一句话想法）与“专业模式”（填写结构化故事蓝图表单）两种入口。\n\n剧本实时生成与编辑面板：左侧为剧本文本（自动渲染标准格式，支持语法高亮），右侧为可视化故事板（自动提取关键场景与情绪曲线预览）。\n\n智能优化工具箱：提供“增强冲突”、“口语化对白”、“压缩至60秒”等一键式优化按钮，背后对应精细调整过的专业提示词模版。\n\n个人剧本项目库：以项目维度管理剧本的所有历史版本、生成的视觉素材关联文件。\n\n面向系统管理员的管理后台：\n\n剧本引擎配置中心：管理不同题材（如穿越、霸总、重生）的深层故事模版、角色关系数据库、台词风格库。\n\n创意元素市场管理：维护和审核用户可订阅的“高阶情节包”、“专业角色设定”等付费素材。\n\n系统与数据看板：监控剧本生成成功率、平均响应时间、各题材使用热度、用户订阅数据等。\n\n明确不包含的范围（第一期）：\n\n不包含AI绘画、视频生成等下游生产工具的直接集成。\n\n不建立UGC内容社区或剧本交易市场。\n\n不提供自动成片或发布到特定平台的功能。\n\n\n\n流程\n\n\n\n用户剧本创作核心流程\n\n\n\nPlain Textflowchart TD    A[开始：输入创意] --> B{选择创作模式}    B -- 极简模式 --> C[输入一句话梗概<br>如“职场逆袭”]    B -- 专业模式 --> D[填写结构化表单<br>题材/人设/冲突]        C --> E    D --> E[系统调用<br>“专业剧本引擎”]        E --> F{生成结果判断}    F -- 满意 --> G[进入深度编辑<br>（微调对白/节奏）]    F -- 需优化 --> H[使用“智能工具箱”<br>一键强化]    H --> E        G --> I[定稿，保存至项目库]    I --> J[导出标准格式文档<br>或分享给团队]    J --> K[流程结束]\n\n\n\n管理员引擎配置流程\n\n管理员在后台创建新的“题材模板”（如“年代穿越”）。\n\n配置该模板的核心参数：标准三幕结构节点、典型角色关系矩阵、时代特定词汇库、参考节奏曲线。\n\n将此模板与特定的“风格化提示词骨架”绑定，并部署到生成引擎。\n\n创作者在前端选择“年代穿越”题材时，即调用此专用引擎，而非通用模型。\n\n\n\n需求详情\n\n\n\n面向创作者的功能需求\n\n结构化输入引导：\n\n专业模式表单：字段包括“题材（下拉选择）”、“主角设定（标签输入）”、“核心冲突（文本描述）”、“目标时长（滑块选择）”。\n\n实时预览：填写表单时，右侧故事板区域实时生成剧情脉络预览图。\n\n\n\n剧本生成与交互：\n\n格式自动渲染：生成的剧本必须严格区分：【场景】、（动作描述）、角色：对话，并使用不同颜色和缩进清晰区分。\n\n沉浸式编辑：点击任意“对话”行，可进入专注修改模式，系统会提供该角色的性格一致性建议。\n\n\n\n智能优化工具箱：\n\n预设优化指令：提供5-8个基于编剧理论的优化按钮，如“增加一个意外转折”、“让反派更立体”、“将高潮冲突提前”。\n\n自定义指令库：允许用户将自己常用的复杂提示词（如“请用更网感的语言重写”）保存为个人快捷指令。\n\n\n\n面向管理员的功能需求\n\n剧本引擎的可视化配置：\n\n提供图形化界面，允许拖拽调整“起承转合”的节奏节点占比。\n\n支持为不同题材上传特定的“禁忌词库”和“推荐词库”，以约束和引导生成内容风格。\n\n\n\n数据驱动的内容洞察：\n\n分析平台内生成的剧本，自动提炼出“高频冲突类型”、“流行人物设定”，为管理员更新模板提供数据支持。\n\n\n\n数据埋点\n\n\n\n核心埋点事件列表\n\n事件名\n\n触发时机\n\n关键属性\n\nscript_generate_init\n\n点击“生成剧本”按钮\n\nmode（创作模式）, genre（题材）, input_length（输入词数）\n\nscript_generate_success\n\n剧本成功生成并显示\n\ntime_cost（耗时）, script_length（剧本字数）\n\nquick_optimization_click\n\n点击任一优化按钮\n\nbutton_id（按钮类型，如enhance_conflict）\n\nscript_exported\n\n导出最终剧本\n\nexport_format（格式，如.fdx, .txt）\n\n\n\n数据指标与看板\n\n产品健康度看板：\n\n日活跃创作者数（DAU）、剧本生成任务平均成功率（>99%）、平均生成耗时（P95线）。\n\n创作效率看板：\n\n核心指标：用户从登录到首次成功生成剧本的平均时间、使用优化指令的频次占比。\n\n深度指标：用户单剧本平均编辑次数（衡量初稿质量）。\n\n商业价值看板：\n\n各题材模板使用热度排行、付费创意素材的购买率与续费率。",
      "publishedAt": "2026-02-04T13:08:18.222Z",
      "id": "1770210498223",
      "viewCount": 2,
      "createdAt": "2026-02-04T13:08:18.223Z",
      "updatedAt": "2026-02-04T13:08:18.223Z"
    },
    {
      "title": "第四课作业-做一个小工具",
      "slug": "第四课作业-做一个小工具",
      "content": "第四课作业-做一个小工具\n\n初阶作业\n\n用AI做个小工具解决生活中的痛点\n\n痛点发掘\n\n最近在用canva做活动海报的时候，发现网站功能是虽然很丰富，但是很复杂。我的需要只是需要把活动的问题放在图片上这个简单功能就行了。找了一圈，发现能做这个功能的，下载都有水印，用AI生产又经常不符合我的要求。\n\n因此我决定自己做一个极简海报编辑器。\n\n呈现形式\n\n由于我需求的功能是最简单的，所有我决定做一个即开即用的网页应用即可。\n\n使用工具\n\n国内版的Trae\n\n成品截图\n\n\n\n\n\n\n\n我就是要这样朴实无华的功能，简单清晰。当然以后有需要的话，也是可以继续增加各种功能的。\n\n\n\n\n\n进阶作业\n\n通过Skills来给自己工作提个效\n\nSkill需求\n\n在应用开发之前，我个人最困难的就是写PRD文档，所以我觉得在开发前为这个项目装一个写PRD文档的Skill。\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n根据自己的需求，不断和它提要求，直到得到满意的PRD就可以了。",
      "publishedAt": "2026-02-04T13:09:19.771Z",
      "id": "1770210559789",
      "viewCount": 2,
      "createdAt": "2026-02-04T13:09:19.789Z",
      "updatedAt": "2026-02-04T13:09:19.789Z"
    },
    {
      "title": "第五课作业-完成自己个人主页的第一个版本开发",
      "slug": "第五课作业-完成自己个人主页的第一个版本开发",
      "content": "第五课作业-完成自己个人主页的第一个版本开发\n\n听了老师的课语后受益匪浅。根据老师教的，这次我会使用老师给的版本规划提示词，制作成一个技能，然后对主页的设计开发demo版本，然后从中挑选符合自己喜欢的页面作为第一个版本以便后续的开发。\n\n\n\n\n\n\n\n\n\n\n\n通过多轮沟通以后，我加入了前端设计的技能进行样本的开发。\n\n\n\n\n\n\n\n\n\n\n\n\n\n最终我要求AI帮我做了5个风格分别是：一个科技风，一个赛博朋克风，一个像素风，一个新中式风，一个水墨风。\n\n按照我自己个人的喜欢，最终我选择了留下科技风与像素风进行后续的开发。\n\n\n\n\n\n期待下一节课，老师继续教我怎么去把这个应用完善下去。",
      "publishedAt": "2026-02-04T13:10:13.052Z",
      "id": "1770210613057",
      "viewCount": 2,
      "createdAt": "2026-02-04T13:10:13.057Z",
      "updatedAt": "2026-02-04T13:10:13.057Z"
    },
    {
      "title": "第六课-不懂用Claude code，用Trae也能完成作业的全流程",
      "slug": "第六课-不懂用claude-code-用trae也能完成作业的全流程",
      "content": "第六课-不懂用Claude code，用Trae也能完成作业的全流程\n\n\n\n前言\n\n\n\n大家好，现在大家都已经上到第六课了，我感觉很多人还是被困在如何使用工具上。Claude code无疑是最强的编程软件。但是Claude code对于很多小白没有编程基础或者没有编程经验又或者是很少去接触没有接触过这一方面知识的人来说，是属于一个非常困难的软件。Claude code是基于命令行终端去使用，很多人一看到这么多数据和英文估计都是一脸懵逼。当然我也是其中之一。\n\n学习AI Coding是一件很快乐的事情，但是高难度的入门卡会劝退很多人。我差一点就被劝退了。但是老师说过，终点都是一样，工具只是实现的过程。既然我不会用Claude code，那么我就转战用Trae。至于为什么我会选择用Trae，因为Trae是国内免费的软件。\n\n现在我就用TRAE来复刻云舒老师的AI工具主页。\n\n工具选择\n\n\n\n1、闪电说\n\n优先推荐的就是老师推荐的语音输入工具闪电说。\n\n我试过老师推荐的智谱，还有搜狗，包括我mac电脑自带的语音输入法。说实在，真的不尽人意，不是经常输入错字，就是乱添加标点符号，在使用的过程中一段话需要反反复复的去修改，看起来效率提高了。其实效率一点都没改变。\n\n下载地址:https://shandianshuo.cn/\n\n2、Trae国内版\n\n国内版的Trae现在支持solo模式和skill，使用起来虽然会比Claude code的能力会差。但是对于我们现在做简单的作业来说问题不大。\n\n下载地址：https://www.trae.cn/\n\n下载完以后根据提示一步一步去安装就可以了。\n\n\n\n打开以后，我们在左上角去选择SOLO模式，TRAE SOLO 模式是以 AI 为核心、自主驱动的开发模式，区别于 IDE 模式（人类主导），它能自动完成从需求分析、任务拆解、代码生成、测试到部署的全流程，大幅降低开发门槛，适合快速落地创意或迭代复杂项目。\n\n\n\n3、下载好技能SKILL\n\n现在去是支持SKILL的，我在网上和老师推荐的SKILL里面上传给大家，大家可以去用。\n\n大家可以去云舒服老师的网页去下载，里面的文件介绍得很清楚：云舒：写文章找配图太麻烦，于是我给自己捏了个配图助手Skills\n\n以下3个是我必用的技能：\n\n[版本规划技能包.zip]\n\n这个技能的作用就是在我们刚开始聊需求的时候，就跟AI去聊，直到把你的需求说明白、说清楚、满意了以后，再去进行下一步。这个技能是我根据老师给的版本规划提示词用去打包做的技能。\n\n[frontend-design前端设计.zip]\n\n这个技能的作用就是在你做前端页面的时候去调用，通过这个技能去进行前端页面的设计比去自己做的前端页面设计要好看很多。\n\n[prd-doc-writerPRD 文档撰写助手 .zip]\n\n这个技能也是云舒老师给的，prd文档写作助手，我的习惯是在做完版本规划和前端设计以后，把最终的设计结果通过这个技能去写prd文档。\n\n如果大家在GitHub上或者市场上遇到好的技能也可以下载下来去使用。\n\n使用方法\n\n点击设置-规则与技能-技能、创建-上传压缩包-确认，这样你的项目里就有技能可以用了。\n\n但是要注意，TRAE里的技能只能在当前的项目里使用，不能全局使用。如果你新开一个项目，就必须重新创建技能，不过这个问题后续官方肯定会修复的。\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n正式开始开发第一版应用\n\n\n\n1、添加技能\n\n首先我们添加好三个技能，分别是版本规划、前端设计和PRD文档撰写。\n\n\n\n\n\n2、版本规划\n\n我们调用技能版本规划来确定自己的最终需求。接着根据提示去回答问题，根据ai给我们的建议回答问题完以后，确定好我们的需求。我们再进行下一步。\n\n\n\n\n\n确认完以后，AI会让你开始进行开发，但是别急，我们先来学习一下，版本规划、写PRD文档和前端设计到底谁先谁后。\n\n\n\n\n\n\n\n3、前端页面设计\n\n\n\n先做前端页面设计的目的，是为了先验证能不能做出来，做出来以后符不符合自己的要求，UI、布局、样式等等，有问题及时修改，由于没有具体的功能，修改起来不会怕影响。我之前就是先全部开发好，再去修改，结果发现无论你改了A问题，就会出现B问题，一直出BUG，而我就在一直DEBUG。非常痛苦。所以我们先去做一个DEMO，确定了再去开发。\n\n好了，现在直接和AI说，叫它开始生成。\n\n\n\n\n\n现在是生成了，但是不是我喜欢的。我要的是像老师那样的，继续和AI沟通。\n\n\n\n经过几轮的沟通和颜色的调整，最终成果达到自己的预期。\n\n\n\n4、写PRD文档\n\n确定好前端页面设计的样式以后，我们就可以叫AI帮我们写PRD文档了。\n\n然后根据AI提示的问题，回答好，就可以得到一份详细的PRD文档了。\n\n\n\n\n\n5、开发应用\n\n我的习惯在开发应用之前，我会调用技能再去把这份PRD文档去审视一遍，看看有没有漏的，或者写的不好的，让他帮我再完善一下再去开发应用。\n\n\n\n\n\n在开发过程中，会遇到各种不同的问题，我第一步就遇到了，它把我的背景颜色改成白色了，但是没关系，我们让它修改就好了。\n\n\n\n开发好以后，试一下功能，看看各个链接能不能跳转，能就可以了。我先定这个是第一版，开始上传GITHUB。\n\n6、上传GITHUB\n\n这一步很简单，详细的注册看第六课的课件好了，我就不详述了。\n\n第6课：把产品交付到真实世界——上线与发布\n\n\n\n我上传GitHub的方法就是直接跟AI说，让它来给我一步步指导，跟着AI说的去做，就行了。保证不出错，不然下一步就麻烦了。\n\n\n\n\n\n\n\n7、部署vercel\n\n\n\n到了这一步，不出意外的话。。。。就出意外了。\n\n部署的步骤很简单，按照老师课件的步骤一步步做就可以。但问题就卡在，你打不开网站。然后我一天都在处理这个bug。按照课件说的，我们有问题就交个AI来处理，首先看看打开日志，我不需要看懂，只需要会截图就行了。\n\n\n\n但是，意外会不停的重复，就这样截图让AI去处理问题，我修复了一天都没有修复完，最后，最后，我尝试科学了一下。结果。。。。能上了。\n\n所以，在我们使用外国网站的时候，遇到打不开网站的话，有条件的，科学一下，你会发现，其实根本不是BUG的问题，就是自己的问题，\n\n这就是我第一版的个人主页的链接，大家也可以去试试看。\n\nhomepage-personal-tools.vercel.app\n\n\n\n第二版应用开发\n\n第二版的开发我新增了一个后台管理功能，可以在后台对工具进行修改和添加，不过由于技术问题，目前只能通过代码修改来添加删除。同时也上传到了2.0版本。\n\n\n\n\n\n\n\n总结\n\n\n\n使用Trae的好处是所有的功能都有，而且免费，但是在我上那么多课，感觉Claude code是更好的，Trae只是一个替代方案，毕竟它的界面更加友好。下一步我也要开始研究Claude code了。",
      "publishedAt": "2026-02-04T13:19:39.690Z",
      "id": "1770211179690",
      "viewCount": 3,
      "createdAt": "2026-02-04T13:19:39.690Z",
      "updatedAt": "2026-02-04T13:19:39.690Z"
    },
    {
      "title": "新手小白使用Claude Code门槛高？Claude Code+Trae 搭配方案，告别 Cursor和Codex 高额 Token 消耗与使用困难，实战案例全流程分享 ",
      "slug": "新手小白使用claude-code门槛高-claude-code-trae-搭配方案-告别-cursor和codex-高额-token-消耗与使用困难-实战案例全流程分享",
      "content": "新手小白使用Claude Code门槛高？Claude Code+Trae 搭配方案，告别 Cursor和Codex 高额 Token 消耗与使用困难，实战案例全流程分享\n\n\n\n前言\n\n\n\n在学习的过程中，我发现很多同学对使用Claude Code、course还有codex都觉得非常困难。\n\n由于Claude Code是CLI模式，在终端以命令形式进行交互开发应用，对于新手来说这是一个很高的门槛。如果通过course还有codex去使用Claude Code，这会涉及到科学上网还有账号注册的问题。并且界面虽然有中文翻译，但是英文占比也比较高。\n\n对于新手小白（我就是）来说，会非常困难，然后会逐渐产生放弃的念头。而且使用course还有codex，不进行科学上网的话会经常容易进行断线。\n\n因此对于新手小白，我更加建议的是先学会使用国内Trae开发软件，先着手熟悉了IDE界面的应用开发以后，咱们再使用Claude Code配合Trae，这样更符合新手小白的开发，也能用到世界上最强的开发软件。\n\n我会将工具的完整安装流程尽量写清楚，如果有不懂的可以随时来找我。\n\n同时我也会将第七课，第八课的作业以案例形式，分享我的开发过程，我是如何一步步与CC和Trae沟通的，也是我对这次训练营学习的一次大总结。\n\n第七课作业成品链接（极简记账本）：\n\n腾讯云 EdgeOne Pages：https://minimal-ledger-iw25pk3s.edgeone.cool?eo_token=51d648ee442c1f42acccdefc94e12c55&eo_time=1769937303\n\nVercel：https://minimal-ledger.vercel.app/\n\n第八课作业成品链接（个人作品展示主页）：\n\nVercel：https://doubletu-portfolio.vercel.app/\n\n\n\n请务必先看完再操作\n\n工具安装\n\nTrae\n\n\n\n首先我们安装Trae\n\n网址：https://www.trae.cn/\n\n我之前写有一份新手如何用Trae去开发应用，大家可以先看一下。虽然写得不是很好，但主要是展示如何使用。更加高端的应用，咱们暂时不用学，也用不到。\n\n链接：第六课-不懂用Claude code，用Trae也能完成作业的全流程\n\n\n\nClaude Code\n\n\n\n先安装 Node.js \n\n首先准备一下科学，这个自行去解决，我试过不科学的状态下，是无法下载的。\n\n进入网页安装最新版本的 Node.js ，网址： https://nodejs.org/en/download/\n\n\n\nWindows 用户还需要额外安装 Git for Windows，地址： https://git-scm.com/install/windows\n\n\n\n\n\n装好 Node.js 和 Git 后，就可以正式安装Claude Code了。\n\n安装Claude Code\n\n1、打开命令行，输入这段指令\n\nPlain Text npm install -g @anthropic-ai/claude-code\n\n然后按下 Enter 键就可以了，非常简单。\n\nWindows、Mac、Linux 都是用这同一条命令。\n\n\n\n2、如果1的方法安装没有成功，可以试试下面的方法：\n\n Mac、Linux,、WSL，粘贴这条命令，回车\n\nPlaintextcurl -fsSL https://claude.ai/install.sh | bash\n\n如果你的电脑是 Windows，粘贴这条命令，回车\n\nPlaintextirm https://claude.ai/install.ps1 | iex\n\n\n\n安装完成后，输入 Claude --version，如果出现了版本号，则代表安装成功。\n\n\n\nTrae方法\n\n这个方法最简单，感谢黄叔的分享，这里借用一下黄叔的教学链接：Claude Code保姆级入门：不会命令行也能用，我把5个必学技巧全整理好了\n\n打开SOLO模式，直接复制下面的提示词，粘贴给 Trae ：\n\nPlain Text帮我自动检查环境并安装 Claude Code CLI 工具，按以下步骤执行：第一步：前期检查确认我的操作系统类型 (Mac / Linux / Windows)。尝试运行 claude --version 检查是否已安装。如果已安装：显示当前版本号，提示我 \"Claude Code 已安装，直接输入 claude 即可使用\"，并结束所有后续步骤。如果未安装：继续执行下一步。第二步：检查 Node.js运行 node -v 检查 Node.js 是否已安装。如果没有安装，请根据系统提示我安装方法：Mac：运行 brew install node 或去 nodejs.org 下载。Linux：运行 sudo apt install nodejs npm 或去 nodejs.org 下载。Windows：建议运行 winget install -e --id OpenJS.NodeJS 或去 nodejs.org 下载。第三步：安装 Claude Code执行通用安装命令：npm install -g @anthropic-ai/claude-code系统特定处理：Windows：直接在 PowerShell 或 CMD 中运行上述命令即可（无需 WSL）。Mac/Linux：如果遇到 EACCES 权限错误，请自动提示我使用 sudo 重新运行。第四步：验证安装运行 claude --version 检查是否安装成功。如果成功，请提示我直接输入 claude 即可启动工具并开始 OAuth 登录流程。模型选择Auto即可\n\n这个方法真的简单，你就跟着一步步做就可以了。\n\n安装成功以后，在Trae中打开终端，输入Claude，就会看到。\n\n\n\n你们的界面和我的会有点不一样，会有很多红色的英文字，因为还没有接入API还不能用，我当时没截图，没办法给大家看，这个图片是已经接入API了的，不过没关系，继续看下去。\n\n\n\n\n\nClaude Code for VS Code\n\n\n\n刚刚上面的图片是在终端运行的，要学会输入命令才好用，但我是小白，不会命令，所以我们要把Claude Code安装在Trae里面，进行可视化使用。就是按照Claude Code for VS Code。\n\n打开Trae，在IDE模式下，看到最左边的那一栏，点击图片中圈圈的地方，搜索Claude Code for VS Code，然后安装。\n\n\n\n看清楚，别选错了，下面那个是假的。\n\n安装完以后，打开这个插件，点击右上角的按钮。\n\n\n\n然后你就会看到以下这个画面\n\n\n\n这里是要你登录账号，到了这一步，证明你的Claude Code已经安装好了，下一步就是接入API了。\n\n点击设置-打开可以使用危险模式，这个是Claude Code最强大的模式，使用这个模式，就等于全权托管，能全部自己运行，不过也很危险，因为权限太大，会出现乱修改代码，甚至乱删文件，不过我是新手，没试过。。。\n\n\n\n\n\n\n\nCC Switch\n\n\n\n这个是专门用来接入API的软件。\n\n因为要使用Claude Code，必须要使用他们的账号，但是在国内使用google账号很容易被封，所以我们通过这个软件来接入API在国内直接使用，这样就不用科学了。\n\nGitHub地址 ：\n\n 项目地址： https://github.com/farion1231/cc-switch\n\n 下载链接： https://github.com/farion1231/cc-switch/releases\n\n在下载链接下滑到底部，找到 Assets区域 ，根据你的电脑型号下载对应版本。\n\n\n\n下载完以后就开始配置\n\n1. 处理环境变量冲突\n\n打开 CC Switch 后，如果检测到系统环境变量冲突，点击\"查看详情\"，把对应的文件都删除掉。\n\n2. 添加模型供应商\n\n点击右上角的添加按钮：\n\n\n\n 选择某个模型供应商\n\n 填写 API Key 和主模型的 Model ID （在对应模型后台查看）\n\n 点击\"添加\"按钮\n\n\n\n\n\n测试一下模型是否正常\n\n\n\n\n\n\n\n获取API Key\n\n目前国内最推荐的是Minimax和智普GLM，虽然没有Claude、GPT等好用，但是胜在方便，以后可肯定会有模型超过这两个的，像火山，KIMI，都在发力，大家跟着主流走就不会错了。Minimax：\n\n智谱链接：https://www.bigmodel.cn/glm-coding?ic=GW0KBUJ10Q\n\n我以智谱的GLM为例。\n\n点击链接进去以后，注册登录，新用户注册会送2000万的token，但实际能给GLM4.7用的只有600万，其它的都是4.7以下的。\n\n登录以后，点击右上角API KEY，点击【添加新的API KEY】\n\n\n\n创建好名字，复制API KEY，粘贴到CC swich中，按照上述测试一下，看看是否运行正常。\n\n\n\n如果token不够了，就去买，新手购买现在的第一个套餐，非常值得，不买也可以，不过实测，600万的token，不怎么耐用。记得调好闹钟去抢。\n\n\n\n以上的工具都准备好了，我们就开始在Trae中放开手脚来用了。\n\n\n\n\n\n使用技巧\n\n\n\nClaude Code\n\n我们安装好的Claude Code有4种模式，他们的区别和作用如下\n\n名称\n\n中文名称\n\n核心含义\n\n适用场景\n\nask before edits\n\n编辑前询问\n\nCC 分析完你的代码修改需求后，不会直接修改 / 写入代码，而是先生成拟修改的代码内容 + 修改说明，等待你手动确认 “是否执行这次编辑”，确认后才会真正改动你的代码文件。\n\n新手使用 CC，还不熟悉其代码编辑的准确性，需要先校验\n\nedit automatically\n\n自动编辑\n\nCC 分析完你的代码需求后，无需你的手动确认，直接根据分析结果修改、新增、删除你的代码文件，修改完成后会向你反馈修改内容、修改文件、修改说明。\n\n需求明确、修改逻辑简单的场景，信任其修改思路，需要快速完成批量小修改\n\nplan mode\n\n规划模式\n\n当你提出一个复杂的代码需求（比如 “开发一个用户登录注册模块”“重构一个数据处理接口”），Claude 会先把这个大需求拆解成多个可执行的小任务，并为每个小任务提供具体的实现思路、技术选型、代码框架，甚至会标注任务的执行顺序、依赖关系。\n\n需求复杂、步骤繁多的代码任务（比如项目初始化、模块开发、大型代码重构）；\n\n不确定如何拆解需求，需要 Claude 提供清晰的实现路径；\n\nbypass permissions\n\n绕过权限\n\n（也叫做危险模式）\n\n默认情况下，Claude Code 的操作会受所在平台（比如 Anthropic 平台、集成的 IDE / 代码仓库）的权限控制，比如无法修改只读文件、系统保护文件、无操作权限的仓库文件，开启这个模式后，Claude 会绕过这些平台级的权限校验，执行原本无权限的代码编辑 / 文件操作。\n\n临时修改项目中的只读配置文件、模板文件，且不想手动修改系统权限；\n\n在集成环境中（比如 Claude Code for VS Code），因 IDE 权限设置导致无法编辑部分文件；\n\n操作个人私有代码仓库，临时需要 Claude 执行高权限操作（比如新建分支、推送轻量代码）；\n\n重要注意\n\n该模式有安全风险，严禁在生产环境、公共代码仓库中随意开启，仅适合个人项目、测试环境的临时权限豁免，开启后要严格校验 Claude 的操作，防止恶意 / 误操作。\n\n核心总结 + 场景快速选择表\n\n关键要点回顾\n\n前两个是代码编辑的决策模式（要不要确认再改），第三个是任务处理模式（只规划不执行），第四个是权限控制模式（突破操作限制）；\n\n日常使用优先ask before edits（保守） 或edit automatically（高效），复杂需求先开plan mode拆解，权限问题才用bypass permissions；\n\nbypass permissions是 “应急模式”，非必要不开启，避免安全风险。\n\n快速选择表（按需求选模式）\n\n\n\n点击图片可查看完整电子表格\n\n简单来说，这四个模式覆盖了 Claude Code 从 **“方案设计”→“代码编辑”→“权限控制”的全流程，核心是让你根据需求复杂度、代码重要性、操作权限灵活切换，平衡效率、安全、可行性 **。\n\n\n\n组合使用\n\n\n\n大家现在能看到，左边是Claude Code，右边是Trae，实测下来，我建议大家把两个工具一起使用，再加一个豆包桌面版，那基本上就足够小白愉快使用了。这就是老师说的\n\nCourse+Claude Code和Codex+Claude Code混合使用，我是因为现在是学习阶段，想省钱，所以用Trae来代替。\n\nClaude Code来负责开发，Trae用来做小问题修改，例如删除小组件，问问题，用前端设计技能设计页面等小问题，但是大的修改还是通过Claude Code来负责。\n\n豆包的作用就是在Claude Code出现英文提示的时候，用作翻译，以及一堆英文给你选择的时候，直接截图丢给豆包帮我解释怎么选择。\n\n\n\n当然你也选择截图，然后上传给Trae来回答。\n\n现在Trae已经全面支持了skill的使用，并且的全局支持，不再需要每次新项目都添加一次Skill，新手也可以创建一个claude code的使用技巧skill，有什么不懂的可以直接在去里面进行提问。\n\n简单的问题，我建议在Trae中多问，包括提示词，也可以使用Trae的提示词优化，优化完再复制给Claude Code使用。\n\nSkill安装 \n\n\n\nSkill 是 Claude Code 推出的重要功能。\n\n你可以把 Skill 理解成前人已经测试验证好的工作流，你只需要借来用就好了。\n\n你可以直接从现有的 Skill 网站里 copy，也可以让 CC 自己创建。\n\n1、官方的 Skill \n\n这是官方的 Skill 指南 https://github.com/anthropics/skills\n\n2、Skill市场\n\nhttps://skillsmp.com/zh\n\n\n\n进入市场以后，找到自己需要的Skill，点击进去\n\n\n\n1、复制代码，在CC（Claude Code）中粘贴，直接运行，CC就会帮你安装好。\n\n2、下载ZIP压缩包，下载完以后，这个压缩包可以通过CC安装，也可以给Trae安装。\n\n至于选择哪一种，就要看你在实战中怎么用。\n\n在安装前，查看一下，你的Claude code主目录里有没有skills文件夹，如果没有，先创建一个，不要新增的技能不能全局使用。\n\n创建skills文件夹\n\nPlain Textmkdir -p ~/.claude/skills\n\n安装好skill以后，可以输入命令查看一下\n\nPlain Textls ~/.claude/skills\n\n如仍不显示，执行诊断并重启 Claude Code\n\nPlain Textclaude doctorclaude restart\n\n\n\n3、Vercel-Skills\n\nhttps://skills.sh/\n\n\n\n这个Vercel网站出的一个skills聚合网站，左上角的主页能去到Vercel，没看错，就是我们部署前端链接的那个Vercel，点击进去以后，复制代码到终端安装就可以了。\n\n这个网站有个好处，它是安装技能的安装数量进行排列，虽然skills的数量比市场的少，但我个人认为，skills的质量比数量更重要，如果不懂得怎么在Github和skills市场找skills的，就用这个吧，对于新手的我们，也绰绰有余了。\n\n\n\n\n\n注意事项\n\n\n\n通过复制代码让CC或者终端来安装skill，会有一半的概率会因为网络问题无法下载，解决这个问题只能通过科学最稳妥。\n\n但是，最稳妥的方法就是下载zip压缩包，CC的安装方法是解压以后，把skill文件夹放到CC的根目录下的skills文件夹，\n\n案例实战（全流程分析）\n\n案例一——第七课作业：极简记账本\n\n\n\n首先在开发之前，我们要确定好我们自己这次开发的需求。\n\n第七课作业成品链接：\n\n腾讯云 EdgeOne Pages：https://minimal-ledger-iw25pk3s.edgeone.cool?eo_token=51d648ee442c1f42acccdefc94e12c55&eo_time=1769937303\n\nVercel：https://minimal-ledger.vercel.app/\n\n确定需求\n\n我家都是我老婆管账，所以每天的家庭开支我都必须先付款，记录好，然后等积累一段时间以后，我在统计好发给她进行报销。\n\n我日常的操作是:打开备忘录→记录日期、项目、金额→积累记录→将数据加总→把明细和总金额发给老婆→等到账。\n\n在这个过程中，记录和加总就会相对麻烦，我很懒，所以我一直想要找到一个简单便捷的软件帮我进行记录。\n\n但是，我试了很多的APP，小程序，虽然他们功能丰富，界面漂亮，但是也同时增加我的操作步骤。\n\n我梦想中的软件应该是这样:输入金额，选择项目→积累记录一段时间→一键把记录生成账单→导出图片（图片中有明细和总金额）发给老婆→等到账。\n\n这个过程，我实际的动作就是输入数字+导出，减少了文字、日期的输入，减少了数据统计，截图发送的动作。\n\n说干就干，同时也给大家看看在Trae中如何使用Claude Code。\n\nPlain Text我先梳理一下我想要的应用的使用逻辑：我要的应用是WEB应用，只做前端，没有后端保存数据，所有数据保存在本地。为什么我不做小程序和APP？因为web应用上手容易，开发简单。1、小程序的开发，平台自带全套成熟工具+组件库，对于简单的小程序，不需要使用编程软件进行开发，如果要开发比较复杂的小程序，那么我们再使用编程软件。但由于我们是新手小白，而且我们这次训练营主要的目的是学习编程。所以，小程序我们先不考虑。2、APP的开发，0基础劝退级，双端独立开发（iOS 用 Swift/OC，Android 用 Java/Kotlin），各自需要专属开发环境 / 电脑配置（比如 iOS 需要 Mac），还要做双端的本地存储适配本地存储优势：虽有原生本地存储 API（如 iOS 的 NSUserDefaults、Android 的 SharedPreferences），但需要分端开发，反而增加工作量应用分4个页面，分别是首页，明细页，统计页，设置页1、在首页输入今日的消费记录。2、明细页记录未销账的消费记录。同时所有的消费记录都保存在统计页的统计分析里。3、点击生成账单按钮，生成的账单会保存在统计页，同时，首页和明细页的记录会清空，进行从新记录，但是统计页的今日消费、本周消费、本月消费数据不会删除，分类消费占比以本月消费的数据进行统计分析。统计页的数据只会在每月的1号才会自动删除，但是账单记录会一直保存，只能用户手动删除。4、设置页增加白天和黑夜两种主题模式，增加数据导出功能\n\n\n\n开发基础知识\n\n\n\n首先科普一下，我们经常听到全栈应用、全栈开发，这是什么东西呢？\n\n全栈应用 = 前端界面 + 后端逻辑 + 云端数据库。\n\n简单说：全栈应用是 “有前端界面、有后端大脑、有云端仓库” 的完整应用，纯前端应用是 “只有界面、数据存在本地” 的轻量应用。\n\n全栈开发 = 能独立做全栈应用的能力。\n\n核心：能独立完成「全栈应用」从 0 到 1 开发的能力，通俗讲就是 “前后端通吃”，不用依赖前端 / 后端工程师配合，自己能搞定：\n\n前端：做用户能看到的界面（如你开发的 Web 页面、小程序、App 界面），用 HTML/CSS/JS/Vue/React 等；\n\n后端：做用户看不到的 “业务大脑”（如数据增删改查、权限判断、逻辑处理），用 Node.js/Java/Python/Go 等；\n\n数据库：做数据的 “云端仓库”（如存用户信息、功能数据），用 MySQL/PostgreSQL/MongoDB 等；\n\n配套能力：能把前后端 + 数据库整合、部署上线，让应用能正常访问使用。\n\n\n\n用我现在的场景举例更易理解：\n\n✅ 我当前的纯前端应用：只有前端页面，数据存在手机浏览器本地，无服务器、无云端数据库，只能自己用、数据无法多设备同步。\n\n✅ 同场景的全栈应用：加了后端服务（处理数据逻辑）和云端数据库（存数据），数据可上传云端，能实现手机 / 电脑多设备同步，甚至能让其他人用且数据互通（按需设置）。\n\n\n\n开发前理清思路\n\n首先我们要知道开发的标准顺序\n\nPlain Text从 0 开发应用，四个环节的标准落地顺序（兼顾逻辑合理性和实操性）如下，适配入门阶段的开发节奏：1、写规划：定核心方向（做什么、给谁用、解决什么问题），框定功能范围和开发目标，是所有环节的基础2、写 PRD 文档：把规划具象化，明确核心功能、交互逻辑、需求边界、验收标准，让设计 / 开发有统一依据3、页面设计：基于 PRD 做视觉和交互设计（原型 / UI），将文字需求转化为可视化的页面方案4、做 demo：基于设计稿开发最小可演示版本，验证核心功能和交互的可行性\n\n那问题又来了，例如说，我要开发的应用要有10个功能，但是核心的功能只要6个，那我在刚开始写规划和prd的时候要全部写进去吗？那做demo的时候，怎么说先做6个功能呢？\n\n规划 + PRD：全写，但必须做「优先级强标注」（核心 6 个标 P1，非核心 4 个标 P2），不用全写细节\n\n不用只写 6 个核心，避免后续漏需求、补改文档更麻烦；但核心 P1 写透，非核心 P2 简化写，既保需求完整，又不增加前期工作量，实操超省心：\n\n1、写规划：功能部分直接分两栏 ——「核心功能（P1，6 个）」「拓展功能（P2，4 个）」，只写功能名称 + 一句话用途，不用多拆；\n\n2、写 PRD：P1 的 6 个核心按之前要求，写透功能流程、交互逻辑、异常处理（开发 / 设计的核心依据）；P2 的 4 个非核心，只写基础功能描述 +「待核心功能验证后迭代开发」，不用拆解交互、不用定细节，一笔带过即可。\n\n做 demo（最小可用版本）：只做 P1 的 6 个核心功能，P2 的 4 个完全不碰\n\ndemo 的核心目标是验证核心功能的可行性、流程跑通性，不是做完整应用，直接在开发文档 / 任务里明确：本次 demo 开发范围仅包含 PRD 中标注 P1 的 6 个核心功能，P2 拓展功能暂不纳入。且这 6 个核心功能在 demo 阶段做到 「能用就行」，不用做视觉细节优化、不用加额外交互，聚焦跑通核心流程（比如查询功能能搜出结果、提交功能能成功保存，就是合格的 demo）。\n\n\n\nSkill准备\n\n现在我们理清思路了，准备开始开发，但在开发之前我们要先把技能准备好。这一次我只使用3个技能分别是版本规划技能，写PRD技能，前端设计技能。\n\n\n\n进入开发（为了写这篇文章，我把应用重新做一遍）\n\n接下来，我把整个开发过程都发出来，要是有不对的地方，希望大家能帮我指正。\n\n在正式进行开发前，我会先和CC和Trae确认一下当前的目录和技能状态（我是小白，所以我才做这个步骤，熟悉了以后就不用了）\n\n\n\n这张图里，做了几件事情：\n\n1、我和Trae确认了在哪个文件夹下工作，让它随时配合。\n\n2、我让CC打开文件开始工作，同时检查自己有哪些技能。\n\n3、CC弹出了给英文选择框，我英渣，和看天书没区别，但我有豆包。打开豆包，左下角截图提问给豆包，按照翻译的结果选择，这里我选2。\n\n\n\n不出意外，意外就出现了，我之前已经给过CC添加技能，但是现在没有了。按照前面Skill安装的步骤检查了一下原因，原来是我之前安装技能的时候，没有创建skills文件，我让CC帮我安装技能，它安装到另一个文件夹上，那我重新创建skills文件夹，把原来的技能文件夹全部复制过去，在CC中再次检查一遍。\n\n\n\nOK，技能有了，万事俱备，开工大吉。\n\n大家一定要记得先设置好技能再用，因为技能能帮我们省下很多token，这都是白花花的真金白银啊。我就下载断断续续的玩了一天，问问问题，修复一下其它应用的bug，结果，工作没做做多少，足足烧了我1000万token，我用粤语5字真言组合语句骂了他不少时间，现在套餐又抢不到，气死我了。准备换其它模型继续薅了。\n\n所以，大家在用CC的时候，一定要把需求和问题写清楚给它，模棱两可的提问和无关重要的问题在隔壁Trae来问。实在不懂怎么提问，就用自然语言说出来，然后在Trae的对话框右下角，有个优化提示词功能，优化一下，再给CC处理。\n\n1、版本规划\n\n\n\n首先，我们要和CC说清楚，我需要用哪个技能开始，然后把自己的需求一股脑给它，尽量把需求写清楚写完整，然后根据提示进行选择。\n\n\n\n在这个过程中，CC会经常弹出选择框给你选择，遇到英文的选择框，就直接豆包截图翻译，再去选择。\n\n\n\n大家也要多看看豆包的解释，基本问你的问题都是授权问题为主，以后熟悉了就不用找豆包翻译了。\n\n注意事项\n\n以下的图片大家看清楚，这里我犯了一个错误\n\n\n\n红色框里显示，它让我运行一段代码，这段代码直接打开终端运行，是显示报错的，因为它要在终端指定这个项目的目录才能运行，像这个小问题，我们不需要在CC中操作浪费token，在右边的trae中输入，点击运行，再去点击链接就可以看到开发好的应用了。\n\n但是，这个流程是错误的，我们应该在完成版本规划以后，写prd文档，然后做页面设计，最后才做mvp，这里会出现问题，是因为在CC写版本规划过程中，会提示我们做选择，我那时在忙，没留意，一直点下一步，所以CC就直接开发了。\n\n针对这个问题，我有两个解决办法：\n\n一是在写需求的时候，最后加一句【确认好版本规划以后，要先写prd文档，然后做页面设计，最后才做mvp，必须按照这个流程去走，不能在确认版本规划以后就开发应用，如果我有选择错误，你要提示我】\n\n二是在CC跳出选择以后，必须用豆包进行翻译（英语好的略过），认真看清楚让你选择的内容在进行选择。\n\n不要像我这样，又浪费不少token。。。。。\n\n2、写prd\n\n在CC沟通进行纠错以后，我们进去写prd文档阶段。\n\n确认操作流程\n\n\n\nCC会先给你一个操作流程图，这里一定要仔细阅读，在脑海中走一遍流程，因为它写的与你想要的不一定一样，你要对不符合自己想法的地方，提出疑问，因为有些功能，它是有的，就像我写的第二行，但是它是默认有这个功能，我们不是专业的程序员，所以该问的一定要问，该确定的一定要确定。\n\n\n\n用户故事详细讨论\n\n\n\n根据提示，一个个问题回答。\n\n回答完问题以后，我会习惯让CC帮我审查和优化一遍，看看有没有遗漏。\n\n\n\n完善以后，生成正式的prd文档，我们就可以进入下一步。\n\n\n\n3、页面设计\n\n\n\n根据提示，进入下一个环节，开始设计页面，但是，这里我又犯错误了，我应该直接在这句话后面写上：先做5个不同风格的样本，样本风格要。。。。。（如果有喜欢的风格），或者是我要每个风格都要不一样，要有设计感，有艺术感，让人一看就喜欢。等等，因为这个错误，这样就浪费了token。\n\n\n\n当然最好的方法是去各种设计网站去看，例如墨刀，Figma，pinterest等等，咱们去欣赏和学习一下别人的优秀作品，然后。。。。。\n\n墨刀：https://modao.cc/brand\n\nFigma：https://www.figma.com/\n\nPinteresthttps://www.pinterest.com/\n\n\n\n如果想省token，这一个环节可以让TRae调用技能来做也是可以的，差别不会太大。我充了智谱的季度会员，用不完，根本用不完，哈哈哈哈。\n\n现在我们来看看生成的几个风格：\n\n纸墨风格、禅意东方风格、赛博朋克风格\n\n\n\n\n\n\n\n\n\n\n\n孟菲斯风格、新艺术运动风格、包豪斯现代主义风格\n\n\n\n\n\n\n\n\n\n大家觉得哪个好看呢，我觉得都不好看，哈哈。所以我打算去学习别人的优秀设计。\n\n\n\n最终成果\n\n\n\n就用这个吧。\n\n在用Trae设计完以后，问它是哪个文件，然后叫CC检查一下，如果有问题就进行修复。\n\n\n\n\n\n4、MVP开发\n\n还是那个问题，我在叫Trae做设计的时候，没有和它说只是做页面设计，它哐哐哐一顿输出，就把开发也做了，还是经验不足啊。\n\n\n\n既然生成好了，就要进行功能测试，不过正常情况下，还是会遇到BUG的，只是多与少，目前只有一个BUG，还好，还好，那就去DEBUG吧。\n\n这里给一个提醒，当CC生成网址的时候，你在对话框中点击网址是会在Trae中显示网页预览，当你在这个网页预览测试功能发现问题是，先别让CC修改，你把网址复制到其它浏览器去测试，看看是否会出现同样的问题。图片中左下角有个错误提醒，我尝试过修复，但是CC提示是没有问题的，但是Trae浏览器中测试就是不行，复制到edge测试，发现一切正常，所以，大家要通过多种方法进行测试，别到最后越改越错，代码堆成屎山。\n\n\n\n5、上传GitHub\n\n在CC中，你和它确认mvp没有问题，让它帮忙上传GitHub，它就会帮你全部搞定，你就负责跟着提示做就对了。\n\n\n\n特别提示一下，如果想要CC帮你们自动上传的，最好开一下科学，不然由于网络慢，经常会连不上网络到时上传失败，这样就必须要手动上传。\n\n\n\n6、生成公网链接（顺便说一下后端数据库）\n\n在所有教学中，大家都建议我们部署到Vercel，但是我尝试过，它生成的公网链接必须要科学才能看到，如果想在国内访问，必须进行其它的配置。\n\n但是我们是学习阶段，会科学的，用vercel，简单方便，链接长期有效；不会科学的，就用腾讯EdgeONe Pages，不过就要3个小时去刷新一下新的临时链接。\n\n那这里又产生问题了：为什么老师教学都推 Vercel+Supabase？我们能不能使用国内的网站代替呢？\n\n答案是当然能用其他方案！\n\n核心结论：这对组合火，是因为免费、0 配置、全栈闭环、学习成本低，完美适配教学与个人项目；但完全可以换，尤其你关注国内访问与数据本地存储时，替代方案更合适。\n\n一、Vercel+Supabase 走红的 5 大原因（教学场景适配）\n\n免费额度足，0 成本入门\n\nVercel：免费 Hobby 计划支持200 个项目，每月 100GB 带宽 + 100 小时构建，个人应用够用\n\nSupabase：免费提供2 个数据库，500MB 存储，支持 5 万月活用户，自带 Auth/API/ 存储，省却自建后端成本\n\n两者都支持 GitHub 一键授权，无需信用卡即可开始，教学门槛极低\n\n0 配置部署，即时反馈\n\nVercel：Git 推送即自动部署，生成预览链接，前端路由 / Vue/React 无压力，新手不用学服务器配置\n\nSupabase：PostgreSQL 数据库点几下就创建，自动生成 REST/GraphQL API，不用写 SQL 和后端代码\n\n前后端分离但能快速打通，教学演示效果好，学员 5 分钟见成果，成就感强\n\n技术栈契合现代全栈趋势\n\n前端：Vercel 与 Next.js（同公司）深度集成，支持 Edge Functions，符合前端主导全栈的方向\n\n后端：Supabase 基于 PostgreSQL，支持实时数据 / WebSocket，弥补 Firebase 闭源短板，且开源可自托管\n\n语言统一：JavaScript/TypeScript 贯穿前后端，前端转全栈不用切换语言语境，学习曲线平缓\n\n全栈能力闭环，覆盖教学核心需求\n\n前端部署 + 后端 API + 数据库 + 认证 + 存储，一套搞定，不用拼接多个工具（如 Heroku+Firebase+Auth0）\n\n适合教 “从 0 到 1 做全栈应用”，学生能完整理解数据流转：前端页面→API 请求→数据库操作→实时响应\n\n社区生态成熟，教学资源丰富\n\n两者文档完善、教程多，遇到问题易搜索；GitHub 模板 / 示例项目多，适合教学复用\n\n适合打造 “最小可行产品”，快速验证想法，符合个人开发者与创业项目节奏\n\n二、当然能用其他方案！按场景选替代（尤其国内访问友好）\n\n1. 国内访问优先：替代 Vercel（前端部署）\n\n\n\n点击图片可查看完整电子表格\n\n2. 后端 / 数据库替代：替代 Supabase（BaaS）\n\n\n\n点击图片可查看完整电子表格\n\n3. 我的特殊场景：数据存手机本地\n\n若应用纯前端 + 本地存储（localStorage/indexedDB），无需 Supabase，部署到国内静态托管平台即可\n\n数据不会上传到平台服务器，安全隔离；他人用我的应用也不会影响我的本地数据，完全独立\n\n三、什么时候换更合适（结合你的需求）\n\n国内访问优先：Vercel 默认域名延迟高，换腾讯云 EdgeOne Pages 等国内平台，速度提升 50%+，不用科学上网\n\n数据本地存储：纯前端应用不需要后端 / BaaS，选国内静态托管即可，简化技术栈，降低学习成本\n\n避免厂商锁定：Supabase 虽开源，但免费版 7 天无访问会自动暂停；云开发 / PocketBase 更适合长期稳定运行\n\n特殊技术需求：若用 Python/Java 做后端，或需复杂计算，可换传统云服务器（ECS）+ 自建数据库，灵活性更高\n\n四、给你的具体建议\n\n当前纯前端本地存储应用：优先选腾讯云 EdgeOne Pages，国内访问快，0 配置部署，数据仍存手机本地，完全符合需求\n\n未来想加云端同步 / 多人使用：国内用云开发 + 云数据库（腾讯 / 阿里），或自建 PocketBase，避免海外服务的访问 / 暂停问题\n\n想尝试轻量全栈：用 “国内静态托管 + 云开发 BaaS” 组合，既保留前端开发习惯，又能快速实现后端能力，国内访问无压力\n\n一句话总结：Vercel+Supabase 是教学与海外项目的好组合，但不是唯一选择；关注国内访问与本地数据时，国内平台更契合需求，且同样能快速上手，不用复杂配置。\n\n\n\n\n\n腾讯云 EdgeOne Pages（正式在国内使用的方法）\n\n\n\n这里我打算使用腾讯云 EdgeOne Pages：https://cloud.tencent.com/\n\n想要在国内使用，要完成4个步骤，部署好网站➡️注册好的域名➡️购买云服务器➡️ICP备案。只有完成了ICP备案，才是真正能长期在国内使用的网站。\n\n1️⃣部署网站\n\n\n\n点击右边Pages快速部署网站，点击导入git仓库，等待它部署，如果提示出现问题，把提示的错误复制个CC，让它解决。\n\n\n\n成功以后，就会显示以下的页面\n\n\n\n点击预览，就会看到一个临时的链接，它这里写的是3个小时，不过我查了资料，3个小时过后，手动刷新就可以得到新的临时链接，这个链接只是作为测试用，并不用真正投入使用。\n\n\n\n如果你需要真正投入使用，你要添加自定义域名，点击蓝色字自定义域名，进入下图页面，点击添加自定义域名。\n\n\n\n\n\n随便输入一个网址，点击备案指引，进入页面后点击开始备案\n\n\n\n\n\n2️⃣注册域名\n\n到了这个界面以后，填入上面的信息，到了域名这里，你要先去注册一个域名。返回腾讯云主页，点击域名注册。\n\n\n\n\n\n\n\n\n\n填好信息模板，购买，等半个小时不到，就拥有属于自己的域名了。\n\n3️⃣购买云服务器\n\n然后我们回到备案页，购买云服务器。\n\n\n\n这里有3个选择：\n\n云服务器：适合企业或者量大的使用，贵\n\n轻量应用服务器：顾名思义，属于小量的使用，便宜\n\n备案授权码：已经备好的服务器生成给你的一个授权码，找人\n\n4️⃣ICP备案\n\n都买了服务器以后填入进去，按下一步，就能完成备案，然后等待几天审核时间。这里因为我没有买云服务器，不能备案，所以没有图片展示。\n\n步骤虽然麻烦，但是如果你想要一个能在国内用的web应用，就只能这样。\n\n找回控制台\n\n这个网站我感觉还是有点复杂，功能太多了，那以后要怎么找到对应的网页呢？\n\n进入页面→登录→右上角控制台→边缘安全加速平台EO→\n\n\n\n\n\n点击进去就可以看到了。\n\nhttps://minimal-ledger-iw25pk3s.edgeone.cool?eo_token=1d241aa2a977b812a9e98817eab12cb5&eo_time=1769910557\n\n7、保存版本到GitHub\n\n所有都做好以后，咱们就要把当前的版本做好命名，进行版本保存管理，这个也是叫CC去解决。\n\n\n\n\n\n\n\n小结：\n\n至此，属于第七课的作业就做完了，在这个案例中，我们通过最基础的方法，利用CC的Ask模式，一步一步跟他去沟通，并且在每一个步骤加入了技能增强它的开发能力，从版本规划——撰写PRD文档——页面设计——MVP开发——上传Github——部署公网——保存版本，遇到问题，如何通过Trae和豆包协助解决。最终顺利把1.0版本做出来。\n\n但这只是开始，不是结束，因为根据版本规划，还有2.0，3.0，4.0版本进行迭代，迭代完了，才是属于一个完整的应用。\n\n案例二——第八课作业：个人作品集\n\n\n\n第八课作业成品链接：\n\nVercel：https://doubletu-portfolio.vercel.app/\n\n自从学习完第八课程开始，我就在想，第七课我已经完成这篇文章了，我的初衷就是想总结我这段时间的学到的知识，如何从0到1开发一个应用，如果再写第二个文档，我认为与我的初衷有所背离，因此我认为，我应该以第八课的作业作为第二个案例，使用与第七课不同的方法去开发应用，同时也对文章进行修改。\n\n在学习的过程，我有空就会去刷抖音，学习相关的知识。突然记起，我在学习skills的时候，刷到过一个skills网站和技能，那时我还不是很了解，所以没留意，现在想起来，就是试试这个方法。顺便把作业写了，也当是一次尝试和学习。\n\n这个网站就是https://skills.sh/，它这里有一个专为这个网站设计的技能：Find Skills。\n\n安装代码如下：\n\nPlain Textnpx skills add https://github.com/vercel-labs/skills --skill find-skills\n\n这个技能的作用，就是当你想对某个任务需要找相应技能的时候，你就向CC或者Trae提问，调用这个技能在这个网站去找想匹配的技能，如果你的任务很特殊，它还能辅助你创建一个适合你的任务的技能。\n\n好了，说了这个多，开始实操吧，先说一下我的思路，我打算通过技能去寻找开发流程中所涉及到的任务相关的技能，每一个任务都通过技能来辅助实现，来测试是否能顺利的开发应用，并且BUG会不会更少，这次我会主要用CC来开发，最近token用不完，哈哈！话不多说，GO！\n\n\n\n1、准备工具\n\n这一次，我没有一上手就开始开发，而是先准备工具。\n\n我打算把这个过程全部粘贴出来，但是这样，这篇文章就很长了，影响阅读，我用另一个文档，把整个过程记录下来，这里只记录开始和结果，有兴趣的点击链接去看看。\n\n沟通过程链接：准备工具沟通过程\n\n首先，我先让CC对我需要开发的应用的流程进行规划，然后对这一整个流程的每一个步骤配备一个SKill。这个过程很磨人，CC一开始对流程的安排是有错误的，辛亏我跟着老师们学了8节课，不然就被它蒙了。所以不要盲目信AI，要有自己的思维，不要它说啥就是啥，它也会错的。例如，我们是先有需求，写规划再写prd，它直接就需求到prd了，具体看链接文档。\n\n别和我犟智能体或者MCP更好用，因为我不懂，以后我会加强这一方面的学习。\n\n\n\n\n\n经过一段时间的激烈讨论，以及我对它的嘲讽\n\n\n\n终于，得到我想要的东西。\n\n\n\n下一步就开始开发了。\n\n在开发前，先和CC说，生成一个Claude.md文件，用于保存聊天记录，或者你直接让它生成一个聊天记录保存文件，要求它保存你和他的聊天记录。我碰到过的情况就是不小心关掉CC，然后记录就不见了。\n\n2、需求挖掘\n\n直接和它说开始进行需求挖掘，但是你要提示一下，我就是忘记了提示它调用技能，只是和CC去沟通。\n\n\n\n没办法，只能在做完以后，要求它调用技能去重新审查。\n\n\n\n使用技能回顾以后，它会把一些之前确定的需求进行更细致挖掘。\n\n这个阶段一定要仔细去做好，你越仔细，后面的阶段就越轻松。\n\n\n\n3、版本规划\n\n还是得提醒CC，要调用技能。\n\n\n\n由于之前我们在需求挖掘已经仔细写好了需求，这一步就是把咱们的需求分成几个版本步骤去进行，首先必须要做出一个MVP。\n\n\n\n\n\n4、写PRD文档\n\n\n\n在这个阶段，我建议从0.1版本开始写，当我们完成第一个版本以后，进行保存，逐步完成整个完整的PRD。\n\n在遇到你不知道怎么回答的时候，你可以让CC给你建议。\n\n\n\n当所有故事写完以后，我建议要快速回顾一下，看看有没有疏漏。\n\n\n\nPRD写好了，我建议让CC回顾一遍开发流程和所需的技能，要时刻提醒CC。\n\n\n\n\n\n5、前端页面设计\n\n根据老师的教学，我们到这一步先做个页面浏览，趁现在功能不复杂的时候，把基础的页面效果做出来。\n\n但是，在之前的规划中，页面设计是在开发以后再做，这就是之前准备工具时是没有规划好开发的流程。现在只能强行提前这个流程了。\n\n\n\n很快，CC就帮我做出了一个demo，不过我不是很满意，肯定要重做。\n\n\n\n但是要重做要怎么做呢？我的方法就是去找一些相关的网站，把网址给CC，让它去进行参考，再进行开发。\n\n\n\n这一个版本，有点感觉了，不过那些七龙珠有点搞些了，哈哈。没事，继续修改。\n\n\n\n就是这个感觉了。\n\n\n\n导航栏有点空，增加一下经典的logo元素\n\n\n\n字体被改了，很丑，还要用回第三版的设计。\n\n\n\n6、应用开发\n\n不出意外的话，又出意外了，等应用第一步开发完了才发现问题。\n\n第一我设计了4版网页设计，下命令开发应用时，忘记说用哪个demo来做，又得浪费时间再做。第二，没有说明调用技能进行开发。。。。。细节还是不够啊。。。。只能让CC复查。结果又重新干一遍。\n\n\n\n完了，还是没变化。\n\n\n\n没办法，继续修改。\n\n\n\n\n\n经过两轮的修改，终于改回来了。浪费了我不少时间。\n\n\n\n为了后续，还是让CC自查一下再继续。\n\n\n\n\n\n所以说，别太相信CC会自动调用技能，该说的还是要说。\n\n\n\n审查完以后，去网页试试功能是否正常，正常就下一步，不正常就去把错误给CC解决。老头眷顾，没问题，进行下一步。\n\n还是保险一点，问问它下一步做什么，确认以后，然后保存聊天记录，再做下一步。\n\n\n\n\n\n天菩萨保佑，又过一关\n\n\n\n接入API\n\n到了这一步，它会提示你填入APIKey，端点，模型，新手技能不会懂，就像我一样，那怎么办呢？我选择接入火山引擎的API，因为方便。火山引擎：https://console.volcengine.com/ark/region:ark+cn-beijing/model/detail?Id=doubao-seed-1-8\n\n\n\n首先去开通你想要开通的服务。\n\n\n\n\n\n去在线推理，点击快速入门，填好名字，就会得到下面一段代码，把代码复制给CC，它会帮你解决。并且会帮你隐藏APIKey。\n\n但是，不要直接在输入框给这段代码，你要先和它说要接入API，等它弹窗对话框时，在对话框中粘贴给它。\n\n\n\n最终，如愿接入，正常使用。\n\n\n\n解决这里以后，我们接着让CC做下一步，不过稳重起见，还是先问一手。\n\n\n\n果然，AI都是会偷懒的。完成以后，让CC进行回顾，确认没有漏掉做哪个步骤。\n\n\n\n\n\n7、上传GitHub\n\n确认完毕后，就开始做上传以及版本管理。\n\n\n\n跟着提示，去GitHub创建好仓库，然后把地址给回CC。接着让CC做版本管理。\n\n\n\n\n\n完成以后，下一步部署。\n\n8、部署Vercel\n\n老规矩，先和CC说部署Vercel。\n\n在新建项目时，记得配置环境变量，不过基本都会出现问题的。\n\n\n\n没事，把日志里的内容全部复制给CC，让它去修复。等了10分钟，搞定。\n\n\n\n最后一步，记得保存聊天记录。\n\n小结\n\n至此，第8课的作业就做完了，但是并不完美。所以我必须要将它迭代完整。\n\n\n\n总结：\n\n\n\n1、新手使用 Claude Code 的痛点：Claude Code 采用 CLI 终端命令交互模式，对新手门槛较高；通过 course、Codex 使用它需解决科学上网、账号注册问题，且界面英文占比高，未科学上网时还易断线，导致新手易产生放弃念头。\n\n2、推荐方案：建议新手先从国内的 Trae 开发软件入手，熟悉 IDE 界面相关的应用开发后，再搭配 Claude Code 使用，该方案既契合新手的学习节奏，又能借助 Claude Code 的强大功能，同时避免了 Cursor 和 Codex 的高额 Token 消耗与使用难题。\n\n\n\nClaude Code、Cursor和Codex 和Trae 、Qoder和CodeBuddy 国内编程软件的比喻\n\n\n\n有一天和孩子聊着学习的事情，突然想到Claude Code和Trae的比喻。Claude Code、Cursor和Codex 等就像一个外国顶尖学校的尖子班优秀学生，Trae、Qoder和CodeBuddy 等就像国内名校的学生。\n\n\n\nClaude Code围绕着各种各样的教授（各种先进的模型） 。你想和Claude Code、Cursor和Codex它们玩，首先，你得有办法出国才能接触它们，然后家里得有钱，得买门票（套餐），不然你去不到人家学校找它们。\n\n\n\nTrae、Qoder和CodeBuddy，它们都有兄弟（国际版）在外国，和Claude Code它们同一个学校，能够找到它们的教授（各种先进的模型）辅助学习，把Claude Code它们的学习方法抄一遍，然后把东西送回来国内，给国内的兄弟（国内版）提提成绩。国内的兄弟们虽然学习了Claude Code它们的学习框架，但是人家的核心思路始终摸不透，所以成绩总是不能达到人家高度，国内的教授（国内的模型）随很厉害，但是还是比人家的教授差一点点。\n\n那我们使用者的比喻呢？新手小白就像小学生，有钱的家庭，直接送国外留学，没钱的家庭就只能在国内学习。有能力勤工俭的大龄同学的也去国外学习，没钱的只能呆着国内。\n\n不知道这个比喻恰不恰当，哈哈。\n\n\n\n个人感慨\n\n\n\n学习的出发点，从来不该只为赚钱。学习到新技能，应该源于心底的热爱，是为了不让自己停下成长的脚步，更是为了与时俱进、不与时代脱节。能靠着新技能，解决生活与工作里的真实痛点，这种成就感与新鲜感，难道不足以让人兴奋吗？真的不必把所有事情，都和赚钱强行挂钩。\n\n\n\n经过这段时间的密集学习，我也深刻体会到老师说的：不要盲目追逐工具。如今 ClaudeCode 风头正盛，眼看 Codex 或将再度独步天下，OpenCode 的热度还未完全铺开，又出现了被众人称赞强悍的 Clawbot（龙虾机器人），这款工具更是几经更名。\n\n\n\n工具迭代的速度，早已远超我们学习使用的速度，那我们真正该提升的究竟是什么？答案是认知。我始终坚信，唯有提升认知，才能不被时代淘汰。工具的本质，是辅助人类更高效地工作与创造，而且工具的学习门槛只会越来越低。未来或许只需一个好想法，就能完成开发、修 bug、搭建后端、落地正式产品，甚至实现自动获客、自动交易，我们只需要登录账号、保管好私密信息即可。\n\n到那时，人与人之间的差距，不再是谁会用更多工具，而是谁有更鲜活的创意，谁对需求有更深刻、更精准的认知。\n\n\n\n\n\n彩蛋\n\n\n\n关于部署公网链接，大家还记得之前说过的吗，通过Vercel部署的链接，只能在科学环境下使用，在国内的话，就必须备案。如果是自己用的小应用的话，在本电脑使用，就不用关注这些问题，因为你开发的应用始终在你的电脑服务你。如果你想要你开发的应用要用于手机或其他电子设备，怎么办？其实也很简单。\n\n一、你必须把应用的功能全部开发好，达到符合你日常使用的状态。\n\n二、把这个完整的应用，写一份完整的PRD文档，一定要力求详尽，与CC（或者其它工具）说清楚，这份PRD文档是用于低代码平台开发使用，必须写清楚。\n\n三、找秒哒等低代码平台，直接“啪”，把PRD丢给他开发。但是开发出来肯定会和你用软件开发的有点不一样，只要功能能用就行了。\n\n四、按照你自己的审美，慢慢修改UI，注意，别一次让它改太多，小心它该蹦。\n\n五、做完以后，直接点部署，然后它给你的公网链接就能在国内随意使用了。你爱换域名也行。\n\n低代码平台有个好处，就是它前后端，备案部署已经全部都搞定好了，我们只需要放心开发就行了。\n\n那肯定有人问，为啥我不直接在那些平台开发呢？要这么麻烦开发两次？答案是可以的，只要你有超能力，你想咋都行，哈哈。",
      "publishedAt": "2026-02-04T13:21:20.113Z",
      "id": "1770211280114",
      "viewCount": 1,
      "createdAt": "2026-02-04T13:21:20.114Z",
      "updatedAt": "2026-02-04T13:21:20.114Z"
    }
  ]
}